---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.TrussFailures
source: html/9e8702c4-3e54-2e2c-7685-2ee54f3b717f.htm
---
# BuiltInFailures.TrussFailures Properties

A structural framing element is attached to a wall whose Structural Usage is set to [Usage].